cases/F17b_kovasznay_ext/case/system/controlDict
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }
application     simpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         4000;          // FIXED iteration count: no residualControl, so the
                               // Class C series is sampled uniformly to the end
deltaT          1;
writeControl    timeStep;
writeInterval   100;           // 40 checkpoints -> the Class C plateau series
purgeWrite      0;
writeFormat     ascii;
writePrecision  12;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable false;
