cases/F17b_kovasznay_ext/case/system/blockMeshDict.template
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
// F17 Kovasznay: x in [-0.5, 1], y in [-0.5, 0.5] (ONE period, cyclic), unit depth.
scale   1;
vertices
(
    (-0.5 -0.5 0)  (1 -0.5 0)  (1 0.5 0)  (-0.5 0.5 0)
    (-0.5 -0.5 1)  (1 -0.5 1)  (1 0.5 1)  (-0.5 0.5 1)
);
blocks ( hex (0 1 2 3 4 5 6 7) (__NX__ __NY__ 1) simpleGrading (1 1 1) );
edges ();
boundary
(
    inlet  { type patch;  faces ((0 4 7 3)); }
    outlet { type patch;  faces ((1 2 6 5)); }
    bottom { type cyclic; neighbourPatch top;    faces ((0 1 5 4)); }
    top    { type cyclic; neighbourPatch bottom; faces ((3 7 6 2)); }
    frontAndBack { type empty; faces ((0 3 2 1) (4 5 6 7)); }
);
